const abilities = [

{
    id:1,

    name:"おとこオーラ",
    kana:"おとこおーら",
    type:"専用",
    category:"防御",
    effect: `
物理攻撃(接触技)を受けた時のみ発動する。<br>
攻撃者に18の固定ダメージを与える。
`
},

{
    id:2,

    name:"は？どっかいけよ",
    kana:"は？どっかいけよ",
    type:"専用",
    category:"補助",
    effect: `
自身の攻撃が命中した時に発動する。<br>
相手の速度を1段階下げる。
`
},

{
    id:3,

    name:"は？やぶさおとこ",
    kana:"は？やぶさおとこ",
    type:"専用",
    category:"攻撃",
    effect: `
場に出た時に1回だけ発動する。<br>
相手全体へ15の固定ダメージを与える。
`
},

{
    id:4,

    name:"雷の力",
    kana:"かみなりのちから",
    type:"専用",
  damage: true,
    category:"攻撃",
    effect:`
雷属性の技が大地属性の相手にも命中する。
`
},

{
    id:5,

    name:"会心の満月",
    kana:"かいしんのまんげつ",
    type:"専用",
    category:"攻撃",
    effect: `
月技が40%の確率で会心になる。
`
},

{
    id:6,

    name:"レインボルト",
    kana:"れいんぼると",
    type:"専用",
    damage: true,
    category:"攻撃",
    effect: `
虹技と雷技の威力が1.2倍になる。
`
},

{
    id: 7,
    name: "ファイアノード",
    kana: "ふぁいあのーど",
    type: "専用",
    category: "防御",
    effect: "弱点のダメージを0.7倍にする。"
},

{
    id:8,

    name:"ブラッドデビル",
    kana:"ぶらっどでびる",
    type:"専用",
    category:"補助",
    effect:`
場に出た時に発動する。<br>
相手全員の攻撃を1段階下げ、出血状態にする。
`
},

  {
    id:9,

    name:"アルファストーン",
    kana:"あるふぁすとーん",
    type:"専用",
    damage:true,
    category:"防御",

    effect:`
    炎、水、雷属性の技を半減する。
    `
},

{
    id:10,

    name:"デスオーラ",
    kana:"ですおーら",
    type:"専用",
    category:"攻撃",
    effect:`
場にいるキャラクターのブラッド属性の技の威力が4/3倍(1.33倍)になる。
`
},

  {
    id:11,

    name:"飛竜乗雲",
    kana:"ひりょうじょううん",
    type:"専用",
    category:"補助",

    effect:`
自身の最大HPの2分の1以下になったとき
「疾風龍形態」へ変化する。
疾風龍形態だと技とステータスが変化する。
`
},

  {
    id:12,

    name:"断罪の仮面",
    kana:"だんざいのかめん",
    type:"専用",
    damage:true,
    category:"攻撃",
    effect:`
相手の能力ランクアップ1つにつき、
与えるダメージが30%上昇する。
`
},

  {
    id:13,

    name:"ポイズンオーラ",
    kana:"ぽいずんおーら",
    type:"専用",
    category:"防御",

    effect:`
技のダメージを受けると50%の確率で相手を毒にする。
`
},

{
    id:14,

    name:"因果律演算機",
    kana:"いんがりつえんざんき",
    type:"専用",
    category:"攻撃",
    effect:`
自身の技が全て必中になる。
`
},

{
    id:15,

    name:"絶対的忠誠心",
    kana:"ぜったいてきちゅうせいしん",
    type:"専用",
    category:"攻撃",
    effect:`
東葉が味方にいる場合、自身と東葉の全ての技の威力が1.5倍になる。<br>
ただし、東葉が相手にいる場合、東葉に与えるダメージが半分になる。
`
},

{
    id:16,

    name:"ムーンヴォイド",
    kana:"むーんゔぉいど",
    type:"専用",
    damage:true,
    category:"攻撃",
    effect:`
月属性の技で攻撃した相手の特防を1段階下げる。
連続技の場合は1回のみ発動する。
`
},

{
    id:17,

    name:"クリスタルブレード",
    kana:"くりすたるぶれーど",
    type:"専用",
    damage: true,
    category:"攻撃",
    effect:`
物理技の威力が1.2倍になり、
40%の確率で相手を出血状態にする。
`
},

  
{
    id:18,

    name:"おとこパワー",

    kana:"おとこパワー",

    type:"専用",

    category:"補助",

    effect:`
選択した味方のHPを63回復する。
`
},

{
    id:19,

    name:"は？ださすぎだろ",

    kana:"は？ださすぎだろ",

    type:"専用",

    category:"防御",
damage: true,
    effect:`
自身のHPが1.5倍になる。
`
},

{
    id:20,

    name:"は？やぶさおこと",

    kana:"は？やぶさおこと",

    type:"専用",

    category:"補助",

    effect:`
場に出た時に1回だけ発動する。
味方全体のHPを15回復する。
`
},

  {
    id: 21,
    name: "ヘヴンロード",
    kana: "へゔんろーど",
    type: "専用",
    category: "攻撃",
    effect: `
攻撃した相手に60%の確率で聖弱点を追加する。
`
},
  
{
    id:22,
    name:"毒霧ノ闇",
    kana:"どくきりのやみ",
    type:"専用",
    category:"防御",
    effect:`
直接攻撃をしてきた相手を毒状態にする。
`
},

  
{
    id:23,
    name:"レインヴォイド",
    kana:"れいんゔぉいど",
    type:"専用",
    category:"補助",
    effect:"虹か闇の攻撃技を使用したとき、または相手から直接攻撃を受けたとき、ヴォイドメーターに1追加する。連続技は1回だけ判定する。ヴォイドメーターの上限は5。"
},

  {
    id: 24,
    name: "アイアンアーマー",
    kana: "あいあんあーまー",
    type: "専用",
    damage: true,
    category: "防御",
    effect: "自身の受けるダメージが0.8倍になる。"
},

  {
    id: 25,
    name: "狂嵐悪魔",
    kana: "きょうらんあくま",
    type: "専用",
    category: "補助",
    effect: `
場に出たときに発動する。
相手全員の特攻を1段階下げ、混乱状態にする。
`
},

  {
    id: 26,
    name: "オメガストーン",
    kana: "おめがすとーん",
    type: "専用",
    category: "防御",
    damage: true,
    effect: "聖、ブラッド、ゴースト属性の技を半減する。"
},

  {
    id: 27,
    name: "ウィークアーマー",
    kana: "うぃーくあーまー",
    type: "専用",
    category: "補助",
    damage: true,
    effect: "自身の防御と特防が20減少するが、速度が2倍になる。"
},
  
{
    id: 28,
    name: "雲蒸竜変",
    kana: "うんじょうりょうへん",
    type: "専用",
    category: "補助",
    effect: `
自身の最大HPの2分の1以下になったとき
「迅雷龍形態」へ変化する。
迅雷龍形態だと技とステータスが変化する。
`
},

  {
    id: 29,
    name: "破滅の神面",
    kana: "はめつのしんめん",
    type: "専用",
    category: "攻撃",
    damage: true,
    effect: "自身の残りHPの割合に応じて与えるダメージが増加する。HP76%以上は1.0倍、51～75%は1.2倍、26～50%は1.3倍、11～25%は1.5倍、10%以下は2倍。"
},

  {
    id: 30,
    name: "グランドオーラ",
    kana: "ぐらんどおーら",
    type: "専用",
    category: "防御",
    effect: `
技のダメージを受けると、50%の確率で相手の攻撃を1段階下げる。
`
},

  {
    id: 31,
    name: "ペネトレーション",
    kana: "ぺねとれーしょん",
    type: "専用",
    category: "攻撃",
    damage: true,
    effect: `
攻撃相手の特防を1段階下げてから攻撃する。
`
},

  {
    id: 32,
    name: "マッドサイエンティスト",
    kana: "まっどさいえんてぃすと",
    type: "専用",
    category: "補助",
    damage: false,
    effect: `
自身が使用するポーション技の優先度+1。
`
},

  {
    id: 33,
    name: "終式・冥界輪廻",
    kana: "しゅうしき・めいかいりんね",
    type: "専用",
    category: "攻撃",
    damage: true,
    effect: `
専用技以外の攻撃技を使用すると月魄形態になり、専用技以外の変化技を使用すると新月形態になる。
受けたダメージの150%分を火力蓄積として蓄える。蓄積上限は500%。
月魄形態で攻撃すると蓄積を発動し、0%に戻る。
蓄積100%でダメージ倍率1.0倍、500%で5.0倍。蓄積20%以下の場合は0.2倍。
`
},

  {
    id: 34,
    name: "メタルライトデュアルソード",
    kana: "めたるらいとでゅあるそーど",
    type: "専用",
    category: "補助",
    damage: false,
    effect: `
自身の物理技の威力が1.2倍になり、
獲得経験値が1.5倍になる。
初期Lvは1、最大Lvは10。
経験値を一定数獲得するとLvが上がり、Lvが高くなるほど次のLvに必要な経験値が増える。
`
},
  
{
    id:35,
    name:"鋼のおとこ",
    kana:"はがねのおとこ",
    type:"専用",
    category:"防御",
    effect:`
ダメージを受けたとき、受けるダメージを18軽減する。
`
},

{
    id:36,
    name:"は？硬すぎだろ",
    kana:"は？かたすぎだろ",
    type:"専用",
    category:"防御",
    effect:`
HPが最大の時、死亡するダメージを受けると必ずHP1で耐える。
`
},

{
    id:37,
    name:"は？やぶさメタル",
    kana:"は？やぶさめたる",
    type:"専用",
    category:"補助",
    effect:`
場に出た時に1回だけ発動する。
自身の防御が1段階上がる。
`
},

  
{
    id:42,
    name:"赫虹剣",
    kana:"かくこうけん",
    type:"専用",
    category:"攻撃",
    effect:"虹技とブラッド技の威力が1.1倍になり、相手に与えたダメージの15%分を吸収する。"
},
{
    id:43,
    name:"血虹悪魔",
    kana:"けっこうあくま",
    type:"専用",
    category:"補助",
    effect:"虹技を使用すると七色虹翼形態になり、ブラッド技を使用すると血剣悪魔形態になる。通常形態が初期形態。七色虹翼形態ではターン終了時にランダムな能力が1段階下がり、別のランダムな能力が1段階上がる。血剣悪魔形態ではターン終了時に最大HPの1/6回復するが、被ダメージが1.2倍になる。"
},


{
    id:101,
    name:"悪戯心",
    kana:"いたずらごころ",
    type:"共通",
    category:"補助",
    effect:`
自身が使う変化技の優先度＋1。
`
},

{
    id:102,
    name:"エレキスキン",
    kana:"えれきすきん",
    type:"共通",
    damage: true,
    category:"攻撃",
    effect:`
自身の無属性の技が雷属性になり、威力が1.2倍になる。
`
},

{
    id:103,
    name:"影踏み",
    kana:"かげふみ",
    type:"共通",
    category:"補助",
    effect:`
相手は交代が出来ない。<br>
相手がゴースト属性や特性「影踏み」の場合は無効。<br>
交代技は交代できる。
`
},

{
    id:104,
    name:"加速",
    kana:"かそく",
    type:"共通",
    category:"補助",
    effect:`
毎ターン速度が1段階上がる。
`
},

{
    id:105,
    name:"貫通",
    kana:"かんつう",
    type:"共通",
    category:"攻撃",
    effect:`
相手の特性の影響を受けずに攻撃できる。<br>
ただし、攻撃後に受ける効果は消えない。
`
},

{
    id:106,
    name:"斬れ味",
    kana:"きれあじ",
    type:"共通",
    damage: true,
    category:"攻撃",
    effect:`
物理攻撃の威力が1.3倍になる。
`
},

{
    id:107,
    name:"クリアアーマー",
    kana:"くりああーまー",
    type:"共通",
    category:"防御",
    effect:`
相手の能力ランクを下げる技や特性の効果を受けない。
`
},

{
    id:108,
    name:"激減",
    kana:"げきげん",
    type:"共通",
    category:"防御",
    effect:`
相手の能力変化の影響を受けない。
`
},

{
    id:109,
    name:"再生力",
    kana:"さいせいりょく",
    type:"共通",
    category:"防御",
    effect:`
交代した時、HPが最大HPの1/3回復する。
`
},

{
    id:110,
    name:"持久力",
    kana:"じきゅうりょく",
    type:"共通",
    damage: true,
    category:"防御",
    effect:`
技のダメージを受けると、防御が1段階上がる。
`
},

{
    id:111,
    name:"スカイスキン",
    kana:"すかいすきん",
    type:"共通",
    damage: true,
    category:"攻撃",
    effect:`
自身の無属性の技が風属性になり、威力が1.2倍になる。
`
},

{
    id:112,
    name:"すり抜け",
    kana:"すりぬけ",
    type:"共通",
    category:"補助",
    effect:`
相手のオーロラベール、光の壁、リフレクター、身代わりの効果を受けない。
`
},

{
    id:113,
    name:"貯水",
    kana:"ちょすい",
    type:"共通",
    category:"防御",
    effect:`
水属性の技を受けるとダメージや効果は無くなり、最大HPの1/4回復する。
`
},

{
    id:114,
    name:"テクニシャン",
    kana:"てくにしゃん",
    type:"共通",
    damage: true,
    category:"攻撃",
    effect:`
威力が60以下の技の威力が1.5倍になる。
`
},

{
    id:115,
    name:"棘の鎧",
    kana:"とげのよろい",
    type:"共通",
    category:"防御",
    effect:`
接触技を受けると、相手のHPを最大HPの1/8減らす。
`
},

{
    id:116,
    name:"浮遊",
    kana:"ふゆう",
    type:"共通",
    damage: true,
    category:"防御",
    effect:`
大地属性の技を受けない。
`
},

{
    id:117,
    name:"フリーズスキン",
    kana:"ふりーずすきん",
    type:"共通",
    damage: true,
    category:"攻撃",
    effect:`
自身の無属性の技が氷属性になり、威力が1.2倍になる。
`
},

{
    id:118,
    name:"マジックガード",
    kana:"まじっくがーど",
    type:"共通",
    category:"防御",
    effect:`
技のダメージ以外を受けない。<br>
自滅技などには影響しない。
`
},

{
    id:119,
    name:"マルチアーマー",
    kana:"まるちあーまー",
    type:"共通",
    damage: true,
    category:"防御",
    effect:`
自身の残りHPが最大値の時、受けるダメージが半減される。
`
},

{
    id:120,
    name:"メタルアーマー",
    kana:"めたるあーまー",
    type:"共通",
    category:"防御",
    effect:`
自身への攻撃は会心にならない。
`
}

];