const characters = [

{
    id:1,

    name:"おとこ",
kana:"おとこ",
images: {
    icon: "images/characters/otoko/icon.png",
    self: "images/characters/otoko/self.png",
    enemy: "images/characters/otoko/enemy.png"
},
    attribute:["おとこ"],

    status:{
        hp:186,
        attack:186,
        defense:88,
        spAttack:186,
        spDefense:63,
        speed:115
    },

    abilities:[
    1,
    2,
    3
],

moves:[
    1,
    2,
    3,
    4,
    5,
    6,

    // 汎用技
    227, // 身代わり
    226, // 守る
    232, // 指を振る
    202, // 大爆発
    200, // 電光石火
  205, //テラバースト
    225, // カウンター
    231, // 瞬迅
    233, // バトンタッチ

    // 雷技
    301, // ボルテッカー
    302, // ワイルドボルト
    303, // 10万ボルト
    304, // ボルトチェンジ
    325, // 電磁波
    326, // 充電

    // 毒技
    802, // ダストシュート
    825, // 毒毒
    826  // 毒菱
],

    ultimate:2001,

zMove:3001,

},

{
    id:2,

    name:"はやぶさ",
    kana:"はやぶさ",
    images: {
      icon: "images/characters/hayabusa/icon.png",
    self: "images/characters/hayabusa/self.png",
    enemy: "images/characters/hayabusa/enemy.png"
},
    attribute:["雷"],

    status:{
        hp:171,
        attack:148,
        defense:90,
        spAttack:155,
        spDefense:96,
        speed:145
    },

    abilities:[
        102,
        105,
        4
    ],

    moves:[
        7,8,9,10,

        200, // 電光石火
202, // 大爆発
203, // スピードスター
204, // トライアタック
      205, //テラバースト
225, // カウンター
226, // 守る
227, // 身代わり
228, // 剣の舞
230, // 瞑想
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ

252, // ニトロチャージ
254, // 火炎放射
275, // 鬼火
276, // 蛍火

301, // ボルテッカー
302, // ワイルドボルト
303, // 10万ボルト
304, // ボルトチェンジ
325, // 電磁波
326, // 充電

401, // アクロバット
403, // エアスラッシュ
452, // 裂傷
652, // 閃光
654, // マジカルシャイン
675, // ミラーコート
801  // 毒突き
    ],

    ultimate:2002,

    zMove:3002
},

{
    id:3,

    name:"こまち",
kana:"こまち",
images: {
  icon: "images/characters/komachi/icon.png",
    self: "images/characters/komachi/self.png",
    enemy: "images/characters/komachi/enemy.png"
},
    attribute:["炎","月"],

    status:{
        hp:156,
        attack:166,
        defense:90,
        spAttack:151,
        spDefense:82,
        speed:150
    },

    abilities:[
        106, // 斬れ味
        114, // テクニシャン
        5  // 会心の満月
    ],

    moves:[
    11,  // 神速斬突・炎
    12,  // 月手裏剣
    13,  // 闇夜之幻
    14,  // 神出斬撃・闇

    // 汎用技
    200, // 電光石火
    201, // 神速
    203, // スピードスター
      205, //テラバースト
    225, // カウンター
    226, // 守る
    227, // 身代わり
    228, // 剣の舞
    230, // 瞑想
    231, // 瞬迅
    232, // 指を振る
    233, // バトンタッチ

    // 炎技
    251, // フレアドライブ
    252, // ニトロチャージ
    253, // 大文字
    254, // 火炎放射
    276, // 蛍火
    275, // 鬼火

    // 風技
    401, // アクロバット
    404, // エアカッター

    // 月技
    501, // 月華一閃
    502, // ムーンスラッシュ
    503, // ムーンフォース
    504, // 玉輪光線
    525, // 月の光
    526, // 月華の舞
    527, // 威光

    // 闇技
    701, // 地獄突き
    702, // アビスメテオ
    703, // 悪の波動
    704, // ナイトバースト

    // 毒技
    801, // 毒突き
    826, // 毒菱

    304, // ボルトチェンジ
    403, // エアスラッシュ
    452, // 裂傷
    751  // アイアンブレード
],

    ultimate:2003,

    zMove:3003
},

{
    id:4,

    name:"東西",
kana:"とうざい",
images: {
  icon: "images/characters/touzai/icon.png",
    self: "images/characters/touzai/self.png",
    enemy: "images/characters/touzai/enemy.png"
},
    attribute:["虹"],

    status:{
        hp:180,
        attack:151,
        defense:93,
        spAttack:151,
        spDefense:107,
        speed:133
    },

    abilities:[
        108, // 激減
        116, // 浮遊
        6  // レインボルト
    ],

    moves:[
    15, // 光速・シャイニングクロウ
    16, // レインボーオーラ
    17, // サンダーソード
    18, // レインボルトノヴァ

    // 汎用技
    200, // 電光石火
    202, // 大爆発
    203, // スピードスター
    204, // トライアタック
      205, //テラバースト
    225, // カウンター
    226, // 守る
    227, // 身代わり
    229, // 羽休め
    230, // 瞑想
    231, // 瞬迅
    232, // 指を振る
    233, // バトンタッチ

    // 炎技
    251, // フレアドライブ
    252, // ニトロチャージ
    254, // 火炎放射
    276, // 蛍火

    // 水技
    351, // アクアブレイク
    352, // クイックターン
    353, // ハイドロポンプ
    376, // 命の雫

    // 雷技
    301, // ボルテッカー
    302, // ワイルドボルト
    303, // 10万ボルト
    304, // ボルトチェンジ
    325, // 電磁波
    326, // 充電

    // 風技
    401, // アクロバット
    402, // ダブルウィンド
    403, // エアスラッシュ
    425, // 追い風

    // ブラッド技
    452, // 裂傷

    // 氷技
    553, // 冷凍ビーム

    // 聖技
    651, // バリアーラッシュ
    652, // 閃光
    653, // アシストパワー
    654, // マジカルシャイン
    675, // ミラーコート
    677, // 光の壁
    678,  // リフレクター

    901, //ドラゴンクロー
    905, //流星群
],

    ultimate:2004,

    zMove:3004
},

{
    id:5,

    name:"山手",
    kana:"やまのて",
    images: {
      icon: "images/characters/yamanote/icon.png",
    self: "images/characters/yamanote/self.png",
    enemy: "images/characters/yamanote/enemy.png"
},
    attribute:["炎"],

    status:{
        hp:165,
        attack:183,
        defense:120,
        spAttack:87,
        spDefense:81,
        speed:129
    },

    abilities:[
        106,
        110,
        7
    ],

moves:[
    19,20,21,22,

    200, // 電光石火
202, // 大爆発
  205, //テラバースト
225, // カウンター
226, // 守る
227, // 身代わり
228, // 剣の舞
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ
251, // フレアドライブ
252, // ニトロチャージ
253, // 大文字
254, // 火炎放射
275, // 鬼火
276, // 蛍火
302, // ワイルドボルト
401, // アクロバット
452, // 裂傷
501, // 月華一閃
502, // ムーンスラッシュ
526, // 月華の舞
601, // 影打ち
625, // 呪い
652, // 閃光
701, // 地獄突き
751,  // アイアンブレード
776, //鉄壁
],

    ultimate:2005,

    zMove:3005
},

{
    id:6,

    name:"丸ノ内XV",
kana:"まるのうちえっくすぶい",
  images: {
    icon: "images/characters/XV/icon.png",
    self: "images/characters/XV/self.png",
    enemy: "images/characters/XV/enemy.png"
},
    attribute:["ブラッド"],

    status:{
        hp:182,
        attack:119,
        defense:76,
        spAttack:146,
        spDefense:176,
        speed:106
    },

    abilities:[
        116, // 浮遊
        109, // 再生力
        8    // ブラッドデビル
    ],

    moves:[
        23, // 青龍王(セギゴード)
        24, // ブラッドプリズン
        25, // ブラッドウェブトラップ
        26, // ブラッドムーンルインレイ
      
    203, // スピードスター
      205, //テラバースト
    226, // 守る
    227, // 身代わり
    229, // 羽休め
    230, // 瞑想
    232, // 指を振る
    233, // バトンタッチ

    254, // 火炎放射
    275, // 鬼火
    276, // 蛍火

    401, // アクロバット
    402, // ダブルウィンド
    403, // エアスラッシュ
    404, // エアカッター
    425, // 追い風

    503, // ムーンフォース
    504, // 玉輪光線
    525, // 月の光
    526, // 月華の舞
    527, // 威光

    451, // 吸血
    452, // 裂傷
    453, // ブラッドムーン
    454, // ブラッドウェーブ
    475, // 力を吸い取る
    476, // 命血

    601, // 影打ち
    625, // 呪い
    626, // 道連れ

    703, // 悪の波動
    725, // 悪魔の囁き
    726, // 深淵の残響
    727,  // 魔力吸収

    901, //ドラゴンクロー
    902, //流星群
],

    ultimate:2006,

    zMove:3006
},

  {
    id:7,

    name:"半蔵門",
    kana:"はんぞうもん",
    images: {
      icon: "images/characters/hanzomon/icon.png",
        self: "images/characters/hanzomon/self.png",
        enemy: "images/characters/hanzomon/enemy.png"
    },

    attribute:["闇","聖"],

    status:{
        hp:170,
        attack:85,
        defense:92,
        spAttack:155,
        spDefense:133,
        speed:120
    },

    abilities:[
        103, // 影踏み
        112, // すり抜け
        9    // アルファストーン
    ],

    moves:[
        27, // 聖闇ローア
        28, // リバースカタストロフ
        29, // ダークマターアビス
        30, // ライトグレネード

        // 無技
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        253, // 大文字
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        303, // 10万ボルト
        304, // ボルトチェンジ
        325, // 電磁波
        326, // 充電

        // 水技
        353, // ハイドロポンプ
        354, // 渦潮
        375, // アクアリング
        376, // 命の雫

        // ゴースト技
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        // 聖技
        651, // バリアーラッシュ
        652, // 閃光
        653, // アシストパワー
        654, // マジカルシャイン
        675, // ミラーコート
        676, // コスモパワー
        677, // 光の壁
        678, // リフレクター

        // 闇技
        701, // 地獄突き
        702, // アビスメテオ
        703, // 悪の波動
        704, // ナイトバースト
        725, // 悪魔の囁き
        726, // 深淵の残響
        727  // 魔力吸収
    ],

    ultimate:2007,

    zMove:3007
},

{
    id:8,

    name:"丸ノ内NI",
    kana:"まるのうちえぬあい",
  images: {
    icon: "images/characters/NI/icon.png",
    self: "images/characters/NI/self.png",
    enemy: "images/characters/NI/enemy.png"
},
    attribute:["ブラッド"],

    status:{
        hp:188,
        attack:133,
        defense:66,
        spAttack:156,
        spDefense:156,
        speed:106
    },

    abilities:[
        116, // 浮遊
        118, // マジックガード
        10    // デスオーラ
    ],

    moves:[
        31, // 神乃悪魔
        32, // 血行上流
        33, // バイオレンスムーン
        34, // ナイトメア・ゼロワールド

        202, // 大爆発
203, // スピードスター
      205, //テラバースト
226, // 守る
227, // 身代わり
229, // 羽休め
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

254, // 火炎放射
275, // 鬼火
276, // 蛍火

401, // アクロバット
402, // ダブルウィンド
403, // エアスラッシュ
404, // エアカッター
425, // 追い風

451, // 吸血
452, // 裂傷
453, // ブラッドムーン
454, // ブラッドウェーブ
475, // 力を吸い取る
476, // 命血

503, // ムーンフォース
504, // 玉輪光線
525, // 月の光
526, // 月華の舞
527, // 威光

625, // 呪い
626, // 道連れ

701, // 地獄突き
725, // 悪魔の囁き
727,  // 魔力吸収

      901, //ドラゴンクロー
    902, //流星群
    ],

    ultimate:2008,

    zMove:3008
},

  {
    id:9,

    name:"埼京",
    kana:"さいきょう",

    images:{
      icon: "images/characters/saikyo/icon.png",
        self:"images/characters/saikyo/self.png",
        enemy:"images/characters/saikyo/enemy.png"
    },

    attribute:["風","龍"],

    status:{
        hp:181,
        attack:80,
        defense:95,
        spAttack:177,
        spDefense:110,
        speed:142
    },

    forms:[
  {
    name:"埼京(疾風龍形態)",
    images:{
      icon: "images/characters/saikyoS/icon.png",
        self:"images/characters/saikyoS/self.png",
        enemy:"images/characters/saikyoS/enemy.png"
    },
    attribute:["龍","風"],
    status:{
      hp:181,
      attack:175,
      defense:110,
      spAttack:145,
      spDefense:110,
      speed:131
    },
    moves:[
      35.1,
      36.1,
    　37.1,
      38.1,
      // 汎用技
        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        252, // ニトロチャージ
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        302, // ワイルドボルト
        303, // 10万ボルト
        304, // ボルトチェンジ

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター
        425, // 追い風
        426, // 安らぎの風
        452, // 裂傷

        // 月技
        504, // 玉輪光線

        // 龍技
        901, // ドラゴンクロー
        902, // ドラゴンテール
        903, // 逆鱗
        904, // スケイルノイズ
        905, // 流星群
        906  // 龍の波動
    ],
    ultimate:2009.1,
    zMove:3009
  }
],

    abilities:[
        111, // スカイスキン
        104, // 加速
        11   // 飛竜乗雲
    ],

    moves:[
        35, // フェニックスハリケーン
        36, // テンペストブラスト
        37, // ドラゴンウェーブ
        38, // 風龍乱舞

        // 汎用技
        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        252, // ニトロチャージ
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        302, // ワイルドボルト
        303, // 10万ボルト
        304, // ボルトチェンジ

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター
        425, // 追い風
        426, // 安らぎの風
        452, // 裂傷

        // 月技
        504, // 玉輪光線

        // 龍技
        901, // ドラゴンクロー
        902, // ドラゴンテール
        903, // 逆鱗
        904, // スケイルノイズ
        905, // 流星群
        906  // 龍の波動
    ],

    ultimate:2009,

    zMove:3009
},

  {
    id:10,

    name:"スカイライナー",
    kana:"すかいらいなー",

    images:{
      icon: "images/characters/skyliner/icon.png",
        self:"images/characters/skyliner/self.png",
        enemy:"images/characters/skyliner/enemy.png"
    },

    attribute:["ゴースト"],

    status:{
        hp:155,
        attack:167,
        defense:105,
        spAttack:95,
        spDefense:95,
        speed:158
    },

    abilities:[
        103, // 影踏み
        106, // 斬れ味
        12   // 断罪の仮面
    ],

    moves:[
        39, // シャドウカルネージ
        40, // キル・コントロール
        41, // シャドウバースト
        42, // ダークネススペクター

        200, // 電光石火
        201, // 神速
        203, // スピードスター
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        252, // ニトロチャージ
        275, // 鬼火

        302, // ワイルドボルト

        401, // アクロバット
        404, // エアカッター

        501, // 月華一閃
        526, // 月華の舞

        601, // 影打ち
        602, // お墓参り
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        701, // 地獄突き
        702, // アビスメテオ
        703, // 悪の波動
        704, // ナイトバースト

        751, // アイアンブレード

        801, // 毒突き
        825, // 毒毒

        852  // ドリルライナー
    ],

    ultimate:2010,

    zMove:3010
},

  {
    id:11,

    name:"総武",
    kana:"そうぶ",

    images:{
      icon: "images/characters/sobu/icon.png",
        self:"images/characters/sobu/self.png",
        enemy:"images/characters/sobu/enemy.png"
    },

    attribute:["毒","鋼"],

    status:{
        hp:175,
        attack:122,
        defense:164,
        spAttack:87,
        spDefense:132,
        speed:95
    },

    abilities:[
        110, // 持久力
        119, // マルチアーマー
        13   // ポイズンオーラ
    ],

    moves:[
        43,
        44,
        45,
        46,

      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        232, // 指を振る
        233, // バトンタッチ

        401, // アクロバット
        403, // エアスラッシュ
        404, // エアカッター

        452, // 裂傷

        502, // ムーンスラッシュ

        601, // 影打ち
        625, // 呪い

        701, // 地獄突き

        751, // アイアンブレード
        752, // バレットパンチ
        753, // ラスターカノン
        754, // 徹底光線
        775, // メタルバースト
        776, // 鉄壁

        801, // 毒突き
        802, // ダストシュート
        803, // アシッドボム
        804, // ヘドロ爆弾
        825, // 毒毒
        826  // 毒菱
    ],

    ultimate:2011,

    zMove:3011
},

{
    id:12,

    name:"東葉",
    kana:"とうよう",
  images: {
    icon: "images/characters/touyou/icon.png",
    self: "images/characters/touyou/self.png",
    enemy: "images/characters/touyou/enemy.png"
},
    attribute:["水","風"],

    status:{
        hp:193,
        attack:96,
        defense:149,
        spAttack:97,
        spDefense:157,
        speed:103
    },

    abilities:[
        108, // 激減
        109, // 再生力
        14   // 因果律演算機
    ],

    moves:[
        // 専用技
        47,
        48,
        49,
        50,

203, // スピードスター
204, // トライアタック
      205, //テラバースト
226, // 守る
227, // 身代わり
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

254, // 火炎放射
275, // 鬼火

351, // アクアブレイク
352, // クイックターン
353, // ハイドロポンプ
354, // 渦潮
375, // アクアリング
376, // 命の雫

401, // アクロバット
402, // ダブルウィンド
403, // エアスラッシュ
404, // エアカッター
425, // 追い風
426, // 安らぎの風

551, // 氷の礫
552, // 氷柱落とし
553, // 冷凍ビーム
554, // フリーズドライ
576, // 黒い霧

651, // バリアーラッシュ
653, // アシストパワー
675, // ミラーコート
676, // コスモパワー
677, // 光の壁
678, // リフレクター

727, // 魔力吸収

776, // 鉄壁

875, // 撒菱
876  // ステルスグランド
    ],

    ultimate:2012,

    zMove:3012
},

{
    id:13,

    name:"南武",
    kana:"なんぶ",
  images: {
    icon: "images/characters/nanbu/icon.png",
    self: "images/characters/nanbu/self.png",
    enemy: "images/characters/nanbu/enemy.png"
},
    attribute:["ゴースト"],

    status:{
        hp:140,
        attack:143,
        defense:142,
        spAttack:156,
        spDefense:133,
        speed:91
    },

    abilities:[
        101, // 悪戯心
        116, // 浮遊
        15   // 絶対的忠誠心
    ],

    moves:[
        51, // ディサピアーゴースト
        52, // シャドウソウルオーバー
        53, // スピチュアルパワー
        54, // デスペリアサクリファイス

202, // 大爆発
203, // スピードスター
204, // トライアタック
      205, //テラバースト
226, // 守る
227, // 身代わり
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

254, // 火炎放射
275, // 鬼火
276, // 蛍火

576, // 黒い霧
602, // お墓参り
603, // 祟り目
604, // シャドーボール
625, // 呪い
626, // 道連れ

701, // 地獄突き
703, // 悪の波動
704, // ナイトバースト
725, // 悪魔の囁き
726, // 深淵の残響
727, // 魔力吸収

801, // 毒突き
803, // アシッドボム
804, // ヘドロ爆弾
825, // 毒毒
826  // 毒菱
],

    ultimate:2013,

    zMove:3013
},

{
    id:14,

    name:"かもめ",
    kana:"かもめ",
  images: {
    icon: "images/characters/kamome/icon.png",
    self: "images/characters/kamome/self.png",
    enemy: "images/characters/kamome/enemy.png"
},
    attribute:["月","氷"],

    status:{
        hp:189,
        attack:80,
        defense:92,
        spAttack:189,
        spDefense:145,
        speed:130
    },

    abilities:[
        112, // すり抜け
        118, // マジックガード
        16   // ムーンヴォイド
    ],

    moves:[
        // 専用技
        55,
        56,
        57,
        58,

203, // スピードスター
204, // トライアタック
      205, //テラバースト
226, // 守る
227, // 身代わり
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

303, // 10万ボルト

353, // ハイドロポンプ
354, // 渦潮
375, // アクアリング
376, // 命の雫

453, // ブラッドムーン

502, // ムーンスラッシュ
503, // ムーンフォース
504, // 玉輪光線
525, // 月の光
526, // 月華の舞
527, // 威光

552, // 氷柱落とし
553, // 冷凍ビーム
554, // フリーズドライ
575, // オーロラベール
576, // 黒い霧

651, // バリアーラッシュ
652, // 閃光
653, // アシストパワー
654, // マジカルシャイン
675, // ミラーコート
676, // コスモパワー
677, // 光の壁
678, // リフレクター

704, // ナイトバースト
727,  // 魔力吸収

  905, //流星群
    ],

    ultimate:2014,

    zMove:3014
},

{
    id:15,

    name:"かがやき",
    kana:"かがやき",
  images: {
    icon: "images/characters/kagayaki/icon.png",
    self: "images/characters/kagayaki/self.png",
    enemy: "images/characters/kagayaki/enemy.png"
},
    attribute:["氷"],

    status:{
        hp:170,
        attack:190,
        defense:92,
        spAttack:115,
        spDefense:82,
        speed:176
    },

    abilities:[
        107, // クリアアーマー
        117, // フリーズスキン
        17   // クリスタルブレード
    ],

    moves:[
        59,
        60,
        61,
        62,

        200, // 電光石火
203, // スピードスター
      205, //テラバースト
225, // カウンター
226, // 守る
227, // 身代わり
228, // 剣の舞
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ
351, // アクアブレイク
352, // クイックターン
551, // 氷の礫
552, // 氷柱落とし
553, // 冷凍ビーム
554, // フリーズドライ
575, // オーロラベール
576, // 黒い霧
452, // 裂傷
401, // アクロバット
403, // エアスラッシュ
601, // 影打ち
701, // 地獄突き
801  // 毒突き
],

    ultimate:2015,

    zMove:3015
},

  
{
    id:16,

    name:"おとこ・ミラー",
kana:"おとこみらー",
    attribute:["おとこ"],

    status:{
        hp:166,
        attack:115,
        defense:63,
        spAttack:186,
        spDefense:88,
        speed:186
    },

    abilities:[
        18, // おとこパワー
        19, // は？ださすぎだろ
        20  // は？やぶさおこと
    ],

    moves:[
        63, // は？・改
        64, // は？きもすぎだろ・改
        65, // は？うざすぎだろ・改
        66, // は？ふざけんなよ・改
        67, // はやぶ三連撃・改
        68, // は？コーラに決まってんだろ・改

        // 汎用技
        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 雷技
        303, // 10万ボルト

        // その他の技
        653, // アシストパワー
        654, // マジカルシャイン
        677, // 光の壁
        678  // リフレクター
    ],

    ultimate:2016,

    zMove:3016
},

  {
    id: 17,
    name: "はやぶさ・ミラー",
    kana: "はやぶさみらー",
    attribute: ["聖"],

    status: {
        hp: 173,
        attack: 188,
        defense: 100,
        spAttack: 106,
        spDefense: 90,
        speed: 148
    },

    abilities: [
        118, // マジックガード
        106, // 斬れ味
        21   // ヘヴンロード
    ],

    moves: [
        // 専用技
        69, // 光壁・改
        70, // シャイニングブレイク・改
        71, // オーバーレディアント・改
        72, // 破滅の災い・改

        // 汎用技
        200, // 電光石火
        201, // 神速
        202, // 大爆発
        204, // トライアタック
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        252, // ニトロチャージ
        254, // 火炎放射
        275, // 鬼火

        // 雷技
        302, // ワイルドボルト

        // 風技
        401, // アクロバット
        403, // エアカッター

        // ブラッド技
        452, // 裂傷

        // 月技
        501, // 月華一閃
        502, // ムーンスラッシュ

        // ゴースト技
        602, // お墓参り
        603, // 祟り目

        // 聖技
        651, // バリアーラッシュ
        652, // 閃光
        653, // アシストパワー
        654, // マジカルシャイン
        676, // コスモパワー
        677, // 光の壁
        678, // リフレクター

        // 大地技
        852  // ドリルライナー
    ],

    ultimate: 2017,
    zMove: 3017
},

  {
    id:18,
    name:"こまち・ミラー",
    kana:"こまちみらー",

    attribute:["炎","毒"],

    status:{
        hp:165,
        attack:180,
        defense:112,
        spAttack:101,
        spDefense:82,
        speed:150,
    },

    abilities:[
        112, // すり抜け
        106, // 斬れ味
        22,  // 毒霧ノ闇
    ],

    moves:[
        73, // 零式神速斬突・毒
        74, // 極大炎手裏剣・零
        75, // 改・毒霧之幻
        76, // 改・神出斬撃・聖

        // 汎用技
        200, // 電光石火
        201, // 神速
        203, // スピードスター
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        252, // ニトロチャージ
        253, // 大文字
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        302, // ワイルドボルト

        // 風技
        401, // アクロバット
        403, // エアスラッシュ

        // ブラッド技
        452, // 裂傷

        // 月技
        501, // 月華一閃
        502, // ムーンスラッシュ

        // ゴースト技
        601, // 影打ち

        // 聖技
        651, // バリアーラッシュ
        652, // 閃光
        654, // マジカルシャイン

        // 闇技
        701, // 地獄突き

        // 鋼技
        751, // アイアンブレード

        // 毒技
        801, // 毒突き
        802, // ダストシュート
        803, // アシッドボム
        804, // ヘドロ爆弾
        825, // 毒毒
        826, // 毒菱
    ],

    ultimate:2018,

    zMove:3018,
},

  
{
    id:19,
    name:"東西・ミラー",
    kana:"とうざいみらー",
    attribute:["虹","闇"],

    status:{
        hp:175,
        attack:92,
        defense:95,
        spAttack:175,
        spDefense:104,
        speed:120
    },

    abilities:[
        116, // 浮遊
        118, // マジックガード
        23   // レインヴォイド
    ],

    
    moves:[
        // 専用技
        77, // 光速・シャドウビーム・零
        78, // レインボーオーラ・改
        79, // ナイトハート・改
        80, // 零式・レインヴォイドアビス

        // 汎用技
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        229, // 羽休め
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 水技
        352, // クイックターン
        353, // ハイドロポンプ
        354, // 渦潮

        // 雷技
        303, // 10万ボルト
        304, // ボルトチェンジ

        // 風技
        401, // アクロバット
        402, // ダブルウィンド

        // ゴースト技
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        // 闇技
        701, // 地獄突き
        703, // 悪の波動
        704, // ナイトバースト
        725, // 悪魔の囁き
        726, // 深淵の残響
        727, // 魔力吸収

        // 鋼技
        753, // ラスターカノン
        754, // 徹底光線

        // 毒技
        803, // アシッドボム
        804, // ヘドロ爆弾

        // 龍技
        905, // 流星群
    ],

    ultimate:2019,

    zMove:3019

},

  {
    id: 20,
    name: "山手・ミラー",
    kana: "やまのて・みらー",

    attribute: ["闇"],

    status: {
        hp: 163,
        attack: 135,
        defense: 167,
        spAttack: 68,
        spDefense: 107,
        speed: 140
    },

    abilities: [
      115,
      120,
        24
    ],

    moves: [
        81, 82, 83, 84,

        200, // 電光石火
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ
        251, // フレアドライブ
        276, // 蛍火
        351, // アクアブレイク
        401, // アクロバット
        404, // エアカッター
        452, // 裂傷
        502, // ムーンスラッシュ
        601, // 影打ち
        625, // 呪い
        701, // 地獄突き
        703, // 悪の波動
        726, // 深淵の残響
        727, // 魔力吸収
        751, // アイアンブレード
      　 776,//鉄壁
        801, // 毒突き
        852  // ドリルライナー
    ],

    ultimate: 2020,
    zMove: 3020
},

  {
    id: 21,
    name: "丸ノ内XV・ミラー",
    kana: "まるのうちえっくすぶいみらー",

    attribute: ["ブラッド", "風"],

    status: {
        hp: 178,
        attack: 133,
        defense: 80,
        spAttack: 156,
        spDefense: 128,
        speed: 130
    },

    abilities: [
        116, // 浮遊
        104, // 加速
        25   // 狂嵐悪魔
    ],

    moves: [
        85, 86, 87, 88,

        202, // 大爆発
        203, // スピードスター
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        229, // 羽休め
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター
        425, // 追い風
      426, //安らぎの風

        451, // 吸血
        452, // 裂傷
        453, // ブラッドムーン
        454, // ブラッドウェーブ
        475, // 力を吸い取る
        476, // 命血

        503, // ムーンフォース
        504, // 玉輪光線
        525, // 月の光
        526, // 月華の舞
        527, // 威光

        603, // 祟り目
        625, // 呪い
        626, // 道連れ

        701, // 地獄突き
      702, //アビスメテオ
        703, // 悪の波動
        725, // 悪魔の囁き
        727, // 魔力吸収

        901, // ドラゴンクロー
        903  // ドラゴンテール
    ],

    ultimate: 2021,
    zMove: 3021
},

  {
    id: 22,
    name: "半蔵門・ミラー",
    kana: "はんぞうもん・みらー",

    attribute: ["闇", "大地"],

    status: {
        hp: 170,
        attack: 80,
        defense: 133,
        spAttack: 160,
        spDefense: 92,
        speed: 120
    },

    abilities: [
        101, // 悪戯心
        105, // 貫通
        26   // オメガストーン
    ],

    moves: [
        // 専用技
        89, // 地闇ローア・零
        90, // オブバースカタストロフ・改
        91, // ダークマターエンド・改
        92, // テラグレネード・零

        // 汎用技
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // ブラッド技
        453, // ブラッドムーン
        454, // ブラッドウェーブ
        476, // 命血

        // 月技
        503, // ムーンフォース
        525, // 月の光
        527, // 威光

        // ゴースト技
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        // 聖技
        653, // アシストパワー
        654, // マジカルシャイン
        675, // ミラーコート

        // 闇技
        701, // 地獄突き
        702, // アビスメテオ
        703, // 悪の波動
        704, // ナイトバースト

        // 大地技
        851, // 地震
        853, // 大地の力
        854, // 熱砂の大地
        875, // 撒菱
        876  // ステルスグランド
    ],

    ultimate: 2022,
    zMove: 3022
},

  {
    id: 23,
    name: "丸ノ内NI・ミラー",
    kana: "まるのうちえぬあいみらー",

    attribute: ["ブラッド", "鋼"],

    status: {
        hp: 155,
        attack: 141,
        defense: 196,
        spAttack: 156,
        spDefense: 101,
        speed: 56
    },

    abilities: [
        116, // 浮遊
        120, // メタルアーマー
        27   // ウィークアーマー
    ],

    moves: [
        // 専用技
        93, // 神乃悪魔・零
        94, // 改・鋼鉄血界
        95, // スチールムーン・改
        96, // ナイトメア・ゼロワールド・改

        // 汎用技
        203, // スピードスター
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        229, // 羽休め
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // 風技
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター

        // ブラッド技
        451, // 吸血
        452, // 裂傷
        453, // ブラッドムーン
        454, // ブラッドウェーブ
        475, // 力を吸い取る
        476, // 命血
        527, // 威光

        // ゴースト技
        625, // 呪い
        626, // 道連れ

        // 闇技
        701, // 地獄突き
        725, // 悪魔の囁き
        727, // 魔力吸収

        // 鋼技
        752, // バレットパンチ
        753, // ラスターカノン
        754, // 徹底光線
        775, // メタルバースト
        776, // 鉄壁

        // 龍技
        901, // ドラゴンクロー
        902  // ドラゴンテール
    ],

    ultimate: 2023,
    zMove: 3023
},
  
{
    id: 24,
    name: "埼京・ミラー",
    kana: "さいきょう・みらー",

    attribute: ["雷", "龍"],

    status: {
        hp: 167,
        attack: 81,
        defense: 94,
        spAttack: 182,
        spDefense: 109,
        speed: 152
    },

    abilities: [
        102, // エレキスキン
        108, // 激減
        28   // 雲蒸竜変
    ],

    moves: [
        97,  // フェニックスサンダー・改
        98,  // ライジングブラスト・零
        99,  // ドラゴンレーザー・改
        100, // 雷龍乱舞・零

        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        251, // フレアドライブ
        252, // ニトロチャージ
        253, // 大文字
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        301, // ボルテッカー
        302, // ワイルドボルト
        303, // 10万ボルト
        304, // ボルトチェンジ
        325, // 電磁波
        326, // 充電

        402, // ダブルウィンド
        403, // エアスラッシュ
        504, // 玉輪光線

        901, // ドラゴンクロー
        902, // ドラゴンテール
        903, // 逆鱗
        904, // スケイルノイズ
        905, // 流星群
        906  // 龍の波動
    ],

    ultimate: 2024,
    zMove: 3024,

    forms: [
        {
            name: "埼京・ミラー(迅雷龍形態)",

            attribute: ["龍", "雷"],

            status: {
                hp: 167,
                attack: 81,
                defense: 111,
                spAttack: 202,
                spDefense: 119,
                speed: 172
            },

            moves: [
                97.1,   // エレキブレス・改
                98.1,   // ドラゴンテールスイープ・改
                99.1,   // ボルトクロスビーム・零
                100.1,  // ドラゴンローア・改

                200, // 電光石火
                202, // 大爆発
                203, // スピードスター
              205, //テラバースト
                226, // 守る
                227, // 身代わり
                230, // 瞑想
                231, // 瞬迅
                232, // 指を振る
                233, // バトンタッチ

                251, // フレアドライブ
                252, // ニトロチャージ
                253, // 大文字
                254, // 火炎放射
                275, // 鬼火
                276, // 蛍火

                301, // ボルテッカー
                302, // ワイルドボルト
                303, // 10万ボルト
                304, // ボルトチェンジ
                325, // 電磁波
                326, // 充電

                402, // ダブルウィンド
                403, // エアスラッシュ
                504, // 玉輪光線

                901, // ドラゴンクロー
                902, // ドラゴンテール
                903, // 逆鱗
                904, // スケイルノイズ
                905, // 流星群
                906  // 龍の波動
            ],

            ultimate: 2024.1,
            zMove: 3024
        }
    ]
},

  {
    id: 25,
    name: "スカイライナー・ミラー",
    kana: "すかいらいなー・みらー",

    attribute: ["風"],

    status: {
        hp: 160,
        attack: 162,
        defense: 115,
        spAttack: 90,
        spDefense: 85,
        speed: 163
    },

    abilities: [
        104, // 加速
        106, // 斬れ味
        29   // 破滅の神面
    ],

    moves: [
        // 専用技
        101, // ゲイルカルネージ・改
        102, // ミスト・コントロール・改
        103, // サイクロンバースト・零
        104, // ハリケーンブレイク・改

        // 汎用技
        200, // 電光石火
        201, // 神速
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        252, // ニトロチャージ
        275, // 鬼火

        // 雷技
        301, // ボルテッカー

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター
        425, // 追い風
        426, // 安らぎの風

        // ブラッド技
        452, // 裂傷

        // 月技
        501, // 月華一閃

        // ゴースト技
        601, // 影打ち

        // 聖技
        651, // バリアーラッシュ

        // 鋼技
        751, // アイアンブレード
        776, // 鉄壁

        // 大地技
        852  // ドリルライナー
    ],

    ultimate: 2025,
    zMove: 3025
},

  {
    id: 26,
    name: "総武・ミラー",
    kana: "そうぶ・みらー",

    attribute: ["大地", "鋼"],

    status: {
        hp: 191,
        attack: 133,
        defense: 152,
        spAttack: 80,
        spDefense: 152,
        speed: 67
    },

    abilities: [
        107, // クリアアーマー
        115, // 棘の鎧
        30   // グランドオーラ
    ],

    moves: [
        // 専用技
        105, // 地震斬撃・改
        106, // ガイアインパルス・零
        107, // スチールバリア・改
        108, // メタルスピンブレイク・改

        // 汎用技
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        232, // 指を振る
        233, // バトンタッチ

        // 風技
        401, // アクロバット
        403, // エアスラッシュ
        404, // エアカッター

        // ブラッド技
        452, // 裂傷

        // 月技
        502, // ムーンスラッシュ

        // ゴースト技
        625, // 呪い

        // 闇技
        701, // 地獄突き
        726, // 深淵の残響

        // 鋼技
        751, // アイアンブレード
        752, // バレットパンチ
        753, // ラスターカノン
        754, // 徹底光線
        775, // メタルバースト
        776, // 鉄壁

        // 大地技
        851, // 地震
        852, // ドリルライナー
        853, // 大地の力
        854, // 熱砂の大地
        875, // 撒菱
        876  // ステルスグランド
    ],

    ultimate: 2026,
    zMove: 3026
},

  {
    id: 27,
    name: "東葉・ミラー",
    kana: "とうよう・みらー",

    attribute: ["水", "毒"],

    status: {
        hp: 170,
        attack: 100,
        defense: 100,
        spAttack: 140,
        spDefense: 100,
        speed: 140
    },

    abilities: [
        105, // 貫通
        113, // 貯水
        31   // ペネトレーション
    ],

    moves: [
        // 専用技
        109, // ハイドロボム・スプラッシュ・改
        110, // ルインウォーター・零
        111, // 神波嵐・改
        112, // ポイズンフォース・改

        // 汎用技
        204, // トライアタック
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        325, // 電磁波

        // 水技
        351, // アクアブレイク
        352, // クイックターン
        353, // ハイドロポンプ
        354, // 渦潮
        375, // アクアリング
        376, // 命の雫

        // 風技
        403, // エアスラッシュ
        404, // エアカッター

        // 氷技
        552, // 氷柱落とし
        553, // 冷凍ビーム
        576, // 黒い霧

        // 聖技
        653, // アシストパワー

        // 闇技
        703, // 悪の波動

        // 毒技
        801, // 毒突き
        802, // ダストシュート
        803, // アシッドボム
        804, // ヘドロ爆弾
        825, // 毒毒
        826  // 毒菱
    ],

    ultimate: 2027,
    zMove: 3027
},

  {
    id: 28,
    name: "南武・ミラー",
    kana: "なんぶ・みらー",
    attribute: ["ゴースト", "雷"],

    status: {
        hp: 143,
        attack: 100,
        defense: 80,
        spAttack: 152,
        spDefense: 150,
        speed: 141
    },

    abilities: [
        116, // 浮遊
        103, // 影踏み
        32   // マッドサイエンティスト
    ],

    moves: [
        113, // 消滅のポーション・改
        114, // サンダーハートオーバー・改
        115, // 充電のポーション・改
        116, // 生贄のポーション・零

        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        301, // ボルテッカー
        302, // ワイルドボルト
        303, // 10万ボルト
        304, // ボルトチェンジ
        325, // 電磁波
        326, // 充電

        602, // お墓参り
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        654, // マジカルシャイン
        725  // 悪魔の囁き
    ],

    ultimate: 2028,
    zMove: 3028
},

{
    id: 29,
    name: "かもめ・ミラー(新月形態)",
    kana: "かもめ・みらーしんげつけいたい",

    attribute: ["月", "ゴースト"],

    // 新月形態
    status: {
        hp: 185,
        attack: 80,
        defense: 160,
        spAttack: 100,
        spDefense: 160,
        speed: 90
    },

    forms: [
        {
            name: "かもめ・ミラー(月魄形態)",
            attribute: ["月", "ゴースト"],

            status: {
                hp: 185,
                attack: 130,
                defense: 85,
                spAttack: 200,
                spDefense: 85,
                speed: 90
            },

            moves: [
                // 専用技
                117, // 月食重力光線・改
                118, // 第零式・神撃
                119, // 虚空第零加護
                120, // 死霊幻影光子・改

                // 汎用技
                203, // スピードスター
              205, //テラバースト
                226, // 守る
                227, // 身代わり
                230, // 瞑想
                232, // 指を振る
                233, // バトンタッチ

                // 炎技
                254, // 火炎放射
                275, // 鬼火
                276, // 蛍火

                // 雷技
                303, // 10万ボルト

                // ブラッド技
                453, // ブラッドムーン

                // 月技
                502, // ムーンスラッシュ
                503, // ムーンフォース
                504, // 玉輪光線
                525, // 月の光
                526, // 月華の舞
                527, // 威光

                // ゴースト技
                601, // 影打ち
                603, // 祟り目
                604, // シャドーボール
                625, // 呪い

                // 聖技
                653, // アシストパワー

                // 闇技
                701, // 地獄突き
                702, // アビスメテオ
                703, // 悪の波動
                704, // ナイトバースト
                727, // 魔力吸収

                // 龍技
                905  // 流星群
            ],

            ultimate: 2029,
            zMove: 3029
        }
    ],

    abilities: [
        105, // 貫通
        103, // 影踏み
        33   // 終式・冥界輪廻
    ],

    moves: [
        // 専用技
        117, // 月食重力光線・改
        118, // 第零式・神撃
        119, // 虚空第零加護
        120, // 死霊幻影光子・改

        // 汎用技
        203, // スピードスター
      205, //テラバースト
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        303, // 10万ボルト

        // ブラッド技
        453, // ブラッドムーン

        // 月技
        502, // ムーンスラッシュ
        503, // ムーンフォース
        504, // 玉輪光線
        525, // 月の光
        526, // 月華の舞
        527, // 威光

        // ゴースト技
        601, // 影打ち
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い

        // 聖技
        653, // アシストパワー

        // 闇技
        701, // 地獄突き
        702, // アビスメテオ
        703, // 悪の波動
        704, // ナイトバースト
        727, // 魔力吸収

        // 龍技
        905  // 流星群
    ],

    ultimate: 2029,
    zMove: 3029
},

  {
    id: 30,
    name: "かがやき・ミラー",
    kana: "かがやき・みらー",

    attribute: ["鋼", "聖"],

    status: {
        hp: 187,
        attack: 175,
        defense: 170,
        spAttack: 93,
        spDefense: 100,
        speed: 100
    },

    abilities: [
        105, // 貫通
        108, // 激減
        34   // メタルライトデュアルソード
    ],

    moves: [
        // 専用技
        121, // オーロラプリズム・改
        122, // アブソリュートレアメタル・改
        123, // フォトンシールド・改
        124, // ブリリアントフォース・改

        // 汎用技
        202, // 大爆発
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        232, // 指を振る
        233, // バトンタッチ

        // 雷技
        302, // ワイルドボルト

        // 風技
        403, // エアスラッシュ

        // ブラッド技
        452, // 裂傷

        // 聖技
        651, // バリアーラッシュ
        652, // 閃光
        654, // マジカルシャイン
        675, // ミラーコート
        676, // コスモパワー
        677, // 光の壁
        678, // リフレクター

        // 鋼技
        751, // アイアンブレード
        752, // バレットパンチ
        753, // ラスターカノン
        754, // 徹底光線
        775, // メタルバースト
        776, // 鉄壁

        // 大地技
        852  // ドリルライナー
    ],

    ultimate: 2030,
    zMove: 3030
},
  
{
    id:31,
    name:"おとこソウル",
    kana:"おとこそうる",

    attribute:["おとこ","鋼"],

    status:{
        hp:186,
        attack:115,
        defense:186,
        spAttack:88,
        spDefense:115,
        speed:63
    },

    abilities:[
        35,
        36,
        37
    ],

    moves:[
        125, // は？・滅
        126, // は？きもすぎだろ・滅
        127, // は？うざすぎだろ・滅
        128, // は？ふざけんなよ・滅
        129, // はやぶ三連撃・滅
        130, // は？ポテトに決まってんだろ・滅

        202, // 大爆発
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        232, // 指を振る
        233, // バトンタッチ
        751, // アイアンブレード
        752, // バレットパンチ
        753, // ラスターカノン
        754, // 徹底光線
        775, // メタルバースト
        776, // 鉄壁
        825, // 毒毒
        826,  // 毒菱
    ],

    ultimate:2031,
    zMove:3031
},

  
{
    id:34,
    name:"東西ソウル",
    kana:"とうざいそうる",
    attribute:["虹","ブラッド"],

    status:{
        hp:156,
        attack:200,
        defense:86,
        spAttack:86,
        spDefense:146,
        speed:106
    },

    forms:[
        {
            name:"東西ソウル(七色虹翼形態)",
            attribute:["虹"],
            status:{
                hp:176,
                attack:180,
                defense:106,
                spAttack:86,
                spDefense:126,
                speed:106
            },
          moves:[
        // 専用技
        139, // 光速・塗血斬・滅
        140, // 七色光衣・終
        141, // 血虹魔剣・滅
        142, // 終式・破滅虹血剣

        // 汎用技
        202, // 大爆発
        204, // トライアタック
            205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        229, // 羽休め
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        254, // 火炎放射
        275, // 鬼火

        // 水技
        351, // アクアブレイク
        352, // クイックターン

        // 雷技
        302, // ワイルドボルト

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター

        // 月技
        502, // ムーンスラッシュ

        // ブラッド技
        451, // 吸血
        452, // 裂傷
        454, // ブラッドウェーブ
        475, // 力を吸い取る
        476, // 命血

        // ゴースト技
        601, // 影打ち
        625, // 呪い
        626, // 道連れ

        // 闇技
        701, // 地獄突き
        703, // 悪の波動
        725, // 悪魔の囁き
        726, // 深淵の残響
        727, // 魔力吸収

        // 鋼技
        751, // アイアンブレード

        // 毒技
        801, // 毒突き

        // 大地技
        852, // ドリルライナー

        // 龍技
        901, // ドラゴンクロー
    ],

    ultimate:2034,
          zMove:3034
        },
        {
            name:"東西ソウル(血剣悪魔形態)",
            attribute:["ブラッド"],
            status:{
                hp:136,
                attack:220,
                defense:66,
                spAttack:86,
                spDefense:166,
                speed:106
            },
          moves:[
        // 専用技
        139, // 光速・塗血斬・滅
        140, // 七色光衣・終
        141, // 血虹魔剣・滅
        142, // 終式・破滅虹血剣

        // 汎用技
        202, // 大爆発
        204, // トライアタック
            205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        229, // 羽休め
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        254, // 火炎放射
        275, // 鬼火

        // 水技
        351, // アクアブレイク
        352, // クイックターン

        // 雷技
        302, // ワイルドボルト

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター

        // 月技
        502, // ムーンスラッシュ

        // ブラッド技
        451, // 吸血
        452, // 裂傷
        454, // ブラッドウェーブ
        475, // 力を吸い取る
        476, // 命血

        // ゴースト技
        601, // 影打ち
        625, // 呪い
        626, // 道連れ

        // 闇技
        701, // 地獄突き
        703, // 悪の波動
        725, // 悪魔の囁き
        726, // 深淵の残響
        727, // 魔力吸収

        // 鋼技
        751, // アイアンブレード

        // 毒技
        801, // 毒突き

        // 大地技
        852, // ドリルライナー

        // 龍技
        901, // ドラゴンクロー
    ],

    ultimate:2034,
          zMove:3034
        }
    ],

    abilities:[
        42, // 赫虹剣
        43  // 血虹悪魔
    ],

    moves:[
        // 専用技
        139, // 光速・塗血斬・滅
        140, // 七色光衣・終
        141, // 血虹魔剣・滅
        142, // 終式・破滅虹血剣

        // 汎用技
        202, // 大爆発
        204, // トライアタック
      205, //テラバースト
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        229, // 羽休め
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        254, // 火炎放射
        275, // 鬼火

        // 水技
        351, // アクアブレイク
        352, // クイックターン

        // 雷技
        302, // ワイルドボルト

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター

        // 月技
        502, // ムーンスラッシュ

        // ブラッド技
        451, // 吸血
        452, // 裂傷
        454, // ブラッドウェーブ
        475, // 力を吸い取る
        476, // 命血

        // ゴースト技
        601, // 影打ち
        625, // 呪い
        626, // 道連れ

        // 闇技
        701, // 地獄突き
        703, // 悪の波動
        725, // 悪魔の囁き
        726, // 深淵の残響
        727, // 魔力吸収

        // 鋼技
        751, // アイアンブレード

        // 毒技
        801, // 毒突き

        // 大地技
        852, // ドリルライナー

        // 龍技
        901, // ドラゴンクロー
    ],

    ultimate:2034,
    zMove:3034
},



];