const characters = [

{
    id:1,

    name:"おとこ",
kana:"おとこ",
images: {
    self: "images/characters/otoko/self.png",
    enemy: "images/characters/otoko/enemy.png"
},
    attribute:["おとこ"],

    status:{
        hp:186,
        attack:186,
        defense:88,
        spAttack:186,
        spDefense:63,
        speed:115
    },

    abilities:[
    1,
    2,
    3
],

moves:[
    1,
    2,
    3,
    4,
    5,
    6,

    // 汎用技
    227, // 身代わり
    226, // 守る
    232, // 指を振る
    202, // 大爆発
    200, // 電光石火
    225, // カウンター
    231, // 瞬迅
    233, // バトンタッチ

    // 雷技
    301, // ボルテッカー
    302, // ワイルドボルト
    303, // 10万ボルト
    304, // ボルトチェンジ
    325, // 電磁波
    326, // 充電

    // 毒技
    802, // ダストシュート
    825, // 毒毒
    826  // 毒菱
],

    ultimate:2001,

zMove:3001,

},

{
    id:2,

    name:"はやぶさ",
    kana:"はやぶさ",
    images: {
    self: "images/characters/hayabusa/self.png",
    enemy: "images/characters/hayabusa/enemy.png"
},
    attribute:["雷"],

    status:{
        hp:171,
        attack:148,
        defense:90,
        spAttack:155,
        spDefense:96,
        speed:145
    },

    abilities:[
        102,
        105,
        4
    ],

    moves:[
        7,8,9,10,

        200, // 電光石火
202, // 大爆発
203, // スピードスター
204, // トライアタック
225, // カウンター
226, // 守る
227, // 身代わり
228, // 剣の舞
230, // 瞑想
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ

252, // ニトロチャージ
254, // 火炎放射
275, // 鬼火
276, // 蛍火

301, // ボルテッカー
302, // ワイルドボルト
303, // 10万ボルト
304, // ボルトチェンジ
325, // 電磁波
326, // 充電

401, // アクロバット
403, // エアスラッシュ
452, // 裂傷
652, // 閃光
654, // マジカルシャイン
675, // ミラーコート
801  // 毒突き
    ],

    ultimate:2002,

    zMove:3002
},

{
    id:3,

    name:"こまち",
kana:"こまち",
images: {
    self: "images/characters/komachi/self.png",
    enemy: "images/characters/komachi/enemy.png"
},
    attribute:["炎","月"],

    status:{
        hp:156,
        attack:166,
        defense:90,
        spAttack:151,
        spDefense:82,
        speed:150
    },

    abilities:[
        106, // 斬れ味
        114, // テクニシャン
        5  // 会心の満月
    ],

    moves:[
    11,  // 神速斬突・炎
    12,  // 月手裏剣
    13,  // 闇夜之幻
    14,  // 神出斬撃・闇

    // 汎用技
    200, // 電光石火
    201, // 神速
    203, // スピードスター
    225, // カウンター
    226, // 守る
    227, // 身代わり
    228, // 剣の舞
    230, // 瞑想
    231, // 瞬迅
    232, // 指を振る
    233, // バトンタッチ

    // 炎技
    251, // フレアドライブ
    252, // ニトロチャージ
    253, // 大文字
    254, // 火炎放射
    276, // 蛍火
    275, // 鬼火

    // 風技
    401, // アクロバット
    404, // エアカッター

    // 月技
    501, // 月華一閃
    502, // ムーンスラッシュ
    503, // ムーンフォース
    504, // 玉輪光線
    525, // 月の光
    526, // 月華の舞
    527, // 威光

    // 闇技
    701, // 地獄突き
    702, // アビスメテオ
    703, // 悪の波動
    704, // ナイトバースト

    // 毒技
    801, // 毒突き
    826, // 毒菱

    304, // ボルトチェンジ
    403, // エアスラッシュ
    452, // 裂傷
    751  // アイアンブレード
],

    ultimate:2003,

    zMove:3003
},

{
    id:4,

    name:"東西",
kana:"とうざい",
images: {
    self: "images/characters/touzai/self.png",
    enemy: "images/characters/touzai/enemy.png"
},
    attribute:["虹"],

    status:{
        hp:180,
        attack:151,
        defense:93,
        spAttack:151,
        spDefense:107,
        speed:133
    },

    abilities:[
        108, // 激減
        116, // 浮遊
        6  // レインボルト
    ],

    moves:[
    15, // 光速・シャイニングクロウ
    16, // レインボーオーラ
    17, // サンダーソード
    18, // レインボルトノヴァ

    // 汎用技
    200, // 電光石火
    202, // 大爆発
    203, // スピードスター
    204, // トライアタック
    225, // カウンター
    226, // 守る
    227, // 身代わり
    229, // 羽休め
    230, // 瞑想
    231, // 瞬迅
    232, // 指を振る
    233, // バトンタッチ

    // 炎技
    251, // フレアドライブ
    252, // ニトロチャージ
    254, // 火炎放射
    276, // 蛍火

    // 水技
    351, // アクアブレイク
    352, // クイックターン
    353, // ハイドロポンプ
    376, // 命の雫

    // 雷技
    301, // ボルテッカー
    302, // ワイルドボルト
    303, // 10万ボルト
    304, // ボルトチェンジ
    325, // 電磁波
    326, // 充電

    // 風技
    401, // アクロバット
    402, // ダブルウィンド
    403, // エアスラッシュ
    425, // 追い風

    // ブラッド技
    452, // 裂傷

    // 氷技
    553, // 冷凍ビーム

    // 聖技
    651, // バリアーラッシュ
    652, // 閃光
    653, // アシストパワー
    654, // マジカルシャイン
    675, // ミラーコート
    677, // 光の壁
    678,  // リフレクター

    901, //ドラゴンクロー
    905, //流星群
],

    ultimate:2004,

    zMove:3004
},

{
    id:5,

    name:"山手",
    kana:"やまのて",
    images: {
    self: "images/characters/yamanote/self.png",
    enemy: "images/characters/yamanote/enemy.png"
},
    attribute:["炎"],

    status:{
        hp:165,
        attack:183,
        defense:120,
        spAttack:87,
        spDefense:81,
        speed:129
    },

    abilities:[
        106,
        110,
        7
    ],

moves:[
    19,20,21,22,

    200, // 電光石火
202, // 大爆発
225, // カウンター
226, // 守る
227, // 身代わり
228, // 剣の舞
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ
251, // フレアドライブ
252, // ニトロチャージ
253, // 大文字
254, // 火炎放射
275, // 鬼火
276, // 蛍火
302, // ワイルドボルト
401, // アクロバット
452, // 裂傷
501, // 月華一閃
502, // ムーンスラッシュ
526, // 月華の舞
601, // 影打ち
625, // 呪い
652, // 閃光
701, // 地獄突き
751,  // アイアンブレード
776, //鉄壁
],

    ultimate:2005,

    zMove:3005
},

{
    id:6,

    name:"丸ノ内XV",
kana:"まるのうちえっくすぶい",
  images: {
    self: "images/characters/XV/self.png",
    enemy: "images/characters/XV/enemy.png"
},
    attribute:["ブラッド"],

    status:{
        hp:182,
        attack:119,
        defense:76,
        spAttack:146,
        spDefense:176,
        speed:106
    },

    abilities:[
        116, // 浮遊
        109, // 再生力
        8    // ブラッドデビル
    ],

    moves:[
        23, // 青龍王(セギゴード)
        24, // ブラッドプリズン
        25, // ブラッドウェブトラップ
        26, // ブラッドムーンルインレイ
      
    203, // スピードスター
    225, // カウンター
    226, // 守る
    227, // 身代わり
    229, // 羽休め
    230, // 瞑想
    232, // 指を振る
    233, // バトンタッチ

    254, // 火炎放射
    275, // 鬼火
    276, // 蛍火

    401, // アクロバット
    402, // ダブルウィンド
    403, // エアスラッシュ
    404, // エアカッター
    425, // 追い風

    503, // ムーンフォース
    504, // 玉輪光線
    525, // 月の光
    526, // 月華の舞
    527, // 威光

    451, // 吸血
    452, // 裂傷
    453, // ブラッドムーン
    454, // ブラッドウェーブ
    475, // 力を吸い取る
    476, // 命血

    601, // 影打ち
    625, // 呪い
    626, // 道連れ

    703, // 悪の波動
    725, // 悪魔の囁き
    726, // 深淵の残響
    727,  // 魔力吸収

    901, //ドラゴンクロー
    902, //流星群
],

    ultimate:2006,

    zMove:3006
},

  {
    id:7,

    name:"半蔵門",
    kana:"はんぞうもん",
    images: {
        self: "images/characters/hanzomon/self.png",
        enemy: "images/characters/hanzomon/enemy.png"
    },

    attribute:["聖","闇"],

    status:{
        hp:170,
        attack:85,
        defense:92,
        spAttack:155,
        spDefense:133,
        speed:120
    },

    abilities:[
        103, // 影踏み
        112, // すり抜け
        9    // アルファストーン
    ],

    moves:[
        27, // 聖闇ローア
        28, // リバースカタストロフ
        29, // ダークマターアビス
        30, // ライトグレネード

        // 無技
        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
        225, // カウンター
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        253, // 大文字
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        303, // 10万ボルト
        304, // ボルトチェンジ
        325, // 電磁波
        326, // 充電

        // 水技
        353, // ハイドロポンプ
        354, // 渦潮
        375, // アクアリング
        376, // 命の雫

        // ゴースト技
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        // 聖技
        651, // バリアーラッシュ
        652, // 閃光
        653, // アシストパワー
        654, // マジカルシャイン
        675, // ミラーコート
        676, // コスモパワー
        677, // 光の壁
        678, // リフレクター

        // 闇技
        701, // 地獄突き
        702, // アビスメテオ
        703, // 悪の波動
        704, // ナイトバースト
        725, // 悪魔の囁き
        726, // 深淵の残響
        727  // 魔力吸収
    ],

    ultimate:2007,

    zMove:3007
},

{
    id:8,

    name:"丸ノ内NI",
    kana:"まるのうちえぬあい",
  images: {
    self: "images/characters/NI/self.png",
    enemy: "images/characters/NI/enemy.png"
},
    attribute:["ブラッド"],

    status:{
        hp:188,
        attack:133,
        defense:66,
        spAttack:156,
        spDefense:156,
        speed:106
    },

    abilities:[
        116, // 浮遊
        118, // マジックガード
        10    // デスオーラ
    ],

    moves:[
        31, // 神乃悪魔
        32, // 血行上流
        33, // バイオレンスムーン
        34, // ナイトメア・ゼロワールド

        202, // 大爆発
203, // スピードスター
225, // カウンター
226, // 守る
227, // 身代わり
229, // 羽休め
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

254, // 火炎放射
275, // 鬼火
276, // 蛍火

401, // アクロバット
402, // ダブルウィンド
403, // エアスラッシュ
404, // エアカッター
425, // 追い風

451, // 吸血
452, // 裂傷
453, // ブラッドムーン
454, // ブラッドウェーブ
475, // 力を吸い取る
476, // 命血

503, // ムーンフォース
504, // 玉輪光線
525, // 月の光
526, // 月華の舞
527, // 威光

625, // 呪い
626, // 道連れ

701, // 地獄突き
725, // 悪魔の囁き
727,  // 魔力吸収

      901, //ドラゴンクロー
    902, //流星群
    ],

    ultimate:2008,

    zMove:3008
},

  {
    id:9,

    name:"埼京",
    kana:"さいきょう",

    images:{
        self:"images/characters/saikyo/self.png",
        enemy:"images/characters/saikyo/enemy.png"
    },

    attribute:["風","龍"],

    status:{
        hp:181,
        attack:80,
        defense:95,
        spAttack:177,
        spDefense:110,
        speed:142
    },

    forms:[
  {
    name:"埼京(疾風龍形態)",
    status:{
      hp:181,
      attack:175,
      defense:110,
      spAttack:145,
      spDefense:110,
      speed:131
    },
    moves:[
      35.1,
      36.1,
    　37.1,
      38.1,
      // 汎用技
        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
        225, // カウンター
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        252, // ニトロチャージ
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        302, // ワイルドボルト
        303, // 10万ボルト
        304, // ボルトチェンジ

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター
        425, // 追い風
        426, // 安らぎの風
        452, // 裂傷

        // 月技
        504, // 玉輪光線

        // 龍技
        901, // ドラゴンクロー
        902, // ドラゴンテール
        903, // 逆鱗
        904, // スケイルノイズ
        905, // 流星群
        906  // 龍の波動
    ],
    ultimate:2009.1
  }
],

    abilities:[
        111, // スカイスキン
        104, // 加速
        11   // 飛竜乗雲
    ],

    moves:[
        35, // フェニックスハリケーン
        36, // テンペストブラスト
        37, // ドラゴンウェーブ
        38, // 風龍乱舞

        // 汎用技
        200, // 電光石火
        202, // 大爆発
        203, // スピードスター
        204, // トライアタック
        225, // カウンター
        226, // 守る
        227, // 身代わり
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        // 炎技
        251, // フレアドライブ
        252, // ニトロチャージ
        254, // 火炎放射
        275, // 鬼火
        276, // 蛍火

        // 雷技
        302, // ワイルドボルト
        303, // 10万ボルト
        304, // ボルトチェンジ

        // 風技
        401, // アクロバット
        402, // ダブルウィンド
        403, // エアスラッシュ
        404, // エアカッター
        425, // 追い風
        426, // 安らぎの風
        452, // 裂傷

        // 月技
        504, // 玉輪光線

        // 龍技
        901, // ドラゴンクロー
        902, // ドラゴンテール
        903, // 逆鱗
        904, // スケイルノイズ
        905, // 流星群
        906  // 龍の波動
    ],

    ultimate:2009,

    zMove:3009
},

  {
    id:10,

    name:"スカイライナー",
    kana:"すかいらいなー",

    images:{
        self:"images/characters/skyliner/self.png",
        enemy:"images/characters/skyliner/enemy.png"
    },

    attribute:["ゴースト"],

    status:{
        hp:155,
        attack:167,
        defense:105,
        spAttack:95,
        spDefense:95,
        speed:158
    },

    abilities:[
        103, // 影踏み
        106, // 斬れ味
        12   // 断罪の仮面
    ],

    moves:[
        39, // シャドウカルネージ
        40, // キル・コントロール
        41, // シャドウバースト
        42, // ダークネススペクター

        200, // 電光石火
        201, // 神速
        203, // スピードスター
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        230, // 瞑想
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        252, // ニトロチャージ
        275, // 鬼火

        302, // ワイルドボルト

        401, // アクロバット
        404, // エアカッター

        501, // 月華一閃
        526, // 月華の舞

        601, // 影打ち
        602, // お墓参り
        603, // 祟り目
        604, // シャドーボール
        625, // 呪い
        626, // 道連れ

        701, // 地獄突き
        702, // アビスメテオ
        703, // 悪の波動
        704, // ナイトバースト

        751, // アイアンブレード

        801, // 毒突き
        825, // 毒毒

        852  // ドリルライナー
    ],

    ultimate:2010,

    zMove:3010
},

  {
    id:11,

    name:"総武",
    kana:"そうぶ",

    images:{
        self:"images/characters/sobu/self.png",
        enemy:"images/characters/sobu/enemy.png"
    },

    attribute:["毒","鋼"],

    status:{
        hp:175,
        attack:122,
        defense:164,
        spAttack:87,
        spDefense:132,
        speed:95
    },

    abilities:[
        110, // 持久力
        119, // マルチアーマー
        13   // ポイズンオーラ
    ],

    moves:[
        43,
        44,
        45,
        46,

        200, // 電光石火
        225, // カウンター
        226, // 守る
        227, // 身代わり
        228, // 剣の舞
        231, // 瞬迅
        232, // 指を振る
        233, // バトンタッチ

        401, // アクロバット
        403, // エアスラッシュ
        404, // エアカッター

        452, // 裂傷

        501, // 月華一閃
        502, // ムーンスラッシュ
        526, // 月華の舞

        601, // 影打ち
        625, // 呪い

        701, // 地獄突き

        751, // アイアンブレード
        752, // バレットパンチ
        753, // ラスターカノン
        754, // 徹底光線
        775, // メタルバースト
        776, // 鉄壁

        801, // 毒突き
        802, // ダストシュート
        803, // アシッドボム
        804, // ヘドロ爆弾
        825, // 毒毒
        826  // 毒菱
    ],

    ultimate:2011,

    zMove:3011
},

{
    id:12,

    name:"東葉",
    kana:"とうよう",
  images: {
    self: "images/characters/touyou/self.png",
    enemy: "images/characters/touyou/enemy.png"
},
    attribute:["水","風"],

    status:{
        hp:193,
        attack:96,
        defense:149,
        spAttack:97,
        spDefense:157,
        speed:103
    },

    abilities:[
        108, // 激減
        109, // 再生力
        14   // 因果律演算機
    ],

    moves:[
        // 専用技
        47,
        48,
        49,
        50,

        200, // 電光石火
203, // スピードスター
204, // トライアタック
225, // カウンター
226, // 守る
227, // 身代わり
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

254, // 火炎放射
275, // 鬼火

351, // アクアブレイク
352, // クイックターン
353, // ハイドロポンプ
354, // 渦潮
375, // アクアリング
376, // 命の雫

401, // アクロバット
402, // ダブルウィンド
403, // エアスラッシュ
404, // エアカッター
425, // 追い風
426, // 安らぎの風

551, // 氷の礫
552, // 氷柱落とし
553, // 冷凍ビーム
554, // フリーズドライ
576, // 黒い霧

651, // バリアーラッシュ
653, // アシストパワー
675, // ミラーコート
676, // コスモパワー
677, // 光の壁
678, // リフレクター

727, // 魔力吸収

776, // 鉄壁

875, // 撒菱
876  // ステルスグランド
    ],

    ultimate:2012,

    zMove:3012
},

{
    id:13,

    name:"南武",
    kana:"なんぶ",
  images: {
    self: "images/characters/nanbu/self.png",
    enemy: "images/characters/nanbu/enemy.png"
},
    attribute:["ゴースト"],

    status:{
        hp:140,
        attack:143,
        defense:142,
        spAttack:156,
        spDefense:133,
        speed:91
    },

    abilities:[
        101, // 悪戯心
        116, // 浮遊
        15   // 絶対的忠誠心
    ],

    moves:[
        51, // ディサピアーゴースト
        52, // シャドウソウルオーバー
        53, // スピチュアルパワー
        54, // デスペリアサクリファイス

202, // 大爆発
203, // スピードスター
204, // トライアタック
225, // カウンター
226, // 守る
227, // 身代わり
230, // 瞑想
232, // 指を振る
233, // バトンタッチ

254, // 火炎放射
275, // 鬼火
276, // 蛍火

576, // 黒い霧
601, // 影打ち
602, // お墓参り
603, // 祟り目
604, // シャドーボール
625, // 呪い
626, // 道連れ

701, // 地獄突き
703, // 悪の波動
704, // ナイトバースト
725, // 悪魔の囁き
726, // 深淵の残響
727, // 魔力吸収

801, // 毒突き
803, // アシッドボム
804, // ヘドロ爆弾
825, // 毒毒
826  // 毒菱
],

    ultimate:2013,

    zMove:3013
},

{
    id:14,

    name:"かもめ",
    kana:"かもめ",
  images: {
    self: "images/characters/kamome/self.png",
    enemy: "images/characters/kamome/enemy.png"
},
    attribute:["月","氷"],

    status:{
        hp:189,
        attack:80,
        defense:92,
        spAttack:189,
        spDefense:145,
        speed:130
    },

    abilities:[
        112, // すり抜け
        118, // マジックガード
        16   // ムーンヴォイド
    ],

    moves:[
        // 専用技
        55,
        56,
        57,
        58,

        200, // 電光石火
203, // スピードスター
204, // トライアタック
225, // カウンター
226, // 守る
227, // 身代わり
230, // 瞑想
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ

303, // 10万ボルト

353, // ハイドロポンプ
354, // 渦潮
375, // アクアリング
376, // 命の雫

453, // ブラッドムーン

501, // 月華一閃
502, // ムーンスラッシュ
503, // ムーンフォース
504, // 玉輪光線
525, // 月の光
526, // 月華の舞
527, // 威光

551, // 氷の礫
552, // 氷柱落とし
553, // 冷凍ビーム
554, // フリーズドライ
575, // オーロラベール
576, // 黒い霧

651, // バリアーラッシュ
652, // 閃光
653, // アシストパワー
654, // マジカルシャイン
675, // ミラーコート
676, // コスモパワー
677, // 光の壁
678, // リフレクター

704, // ナイトバースト
727,  // 魔力吸収

  905, //流星群
    ],

    ultimate:2014,

    zMove:3014
},

{
    id:15,

    name:"かがやき",
    kana:"かがやき",
  images: {
    self: "images/characters/kagayaki/self.png",
    enemy: "images/characters/kagayaki/enemy.png"
},
    attribute:["氷"],

    status:{
        hp:170,
        attack:190,
        defense:92,
        spAttack:115,
        spDefense:82,
        speed:176
    },

    abilities:[
        107, // クリアアーマー
        117, // フリーズスキン
        17   // クリスタルブレード
    ],

    moves:[
        59,
        60,
        61,
        62,

        200, // 電光石火
203, // スピードスター
225, // カウンター
226, // 守る
227, // 身代わり
228, // 剣の舞
231, // 瞬迅
232, // 指を振る
233, // バトンタッチ
351, // アクアブレイク
352, // クイックターン
551, // 氷の礫
552, // 氷柱落とし
553, // 冷凍ビーム
554, // フリーズドライ
575, // オーロラベール
576, // 黒い霧
452, // 裂傷
401, // アクロバット
403, // エアスラッシュ
601, // 影打ち
701, // 地獄突き
801  // 毒突き
],

    ultimate:2015,

    zMove:3015
},

];